In [1]:
import numpy as np
import pandas as pd

**Exercise 1: Create a DataFrame from a dictionary: data = {'apples': [3, 2, 0, 1], 'oranges': [0, 3, 7, 2]} with index=['June', 'Robert', 'Lily', 'David'].**

In [2]:
df1 = pd.DataFrame(data = {'apples': [3, 2, 0, 1], 'oranges': [0, 3, 7, 2]}, index=['June', 'Robert', 'Lily', 'David'])
df1

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

**Exercise 2: the first two rows of the DataFrame using head().**

In [3]:
first2 = df1.head(2)
first2

        apples  oranges
June         3        0
Robert       2        3

**Exercise 3: Select the 'apples' column from the DataFrame in two different ways.**

In [5]:
df1['apples']

June      3
Robert    2
Lily      0
David     1
Name: apples, dtype: int64

In [7]:
df1.loc[:, 'apples']

June      3
Robert    2
Lily      0
David     1
Name: apples, dtype: int64

**Exercise 4: Select rows where the 'oranges' column value is greater than 2.**

In [9]:
df1[df1['oranges'] > 2]

        apples  oranges
Robert       2        3
Lily         0        7

**Exercise 5. Add a new column 'bananas' with values [1, 2, 3, 4].**

In [13]:
df1['bananas'] = [1, 2, 3, 4]
df1

        apples  oranges  bananas
June         3        0        1
Robert       2        3        2
Lily         0        7        3
David        1        2        4

**Exercise 6: Delete the 'bananas' column from the DataFrame.**

In [14]:
del df1['bananas']
df1

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

**Exercise 7. Select multiple columns: ['apples', 'oranges'] from the DataFrame.**

In [16]:
df1[['apples', 'oranges']]

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

**Exercise 8: Use loc to select the row for 'Lily' and the columns 'apples' and 'oranges'.**

In [17]:
df1.loc['Lily']

apples     0
oranges    7
Name: Lily, dtype: int64

**Exercise 9: Use iloc to select the first two rows and the first column.**

In [21]:
df1.iloc[:2, 0]

June      3
Robert    2
Name: apples, dtype: int64

**Exercise 10. Transpose the DataFrame (rows become columns and columns become rows).**

In [22]:
df1.T

         June  Robert  Lily  David
apples      3       2     0      1
oranges     0       3     7      2